{"meta":{"title":"Acer Zhou's Blog","subtitle":null,"description":"BE WATER, MY FRIEND","author":"Acer Zhou","url":"http://acerzhou.github.io/Blog","root":"/Blog/"},"pages":[{"title":"404 Not Found：Could not find Page","date":"2021-01-04T12:13:53.463Z","updated":"2021-01-04T12:13:53.463Z","comments":false,"path":"/404.html","permalink":"http://acerzhou.github.io/Blog/404.html","excerpt":"","text":""},{"title":"About Acer Zhou","date":"2021-01-04T11:28:06.143Z","updated":"2021-01-04T11:28:06.143Z","comments":false,"path":"about/index.html","permalink":"http://acerzhou.github.io/Blog/about/index.html","excerpt":"","text":"This is Acer Zhou"},{"title":"Links","date":"2021-01-04T11:28:06.143Z","updated":"2021-01-04T11:28:06.143Z","comments":false,"path":"links/index.html","permalink":"http://acerzhou.github.io/Blog/links/index.html","excerpt":"","text":"Phil’s Blog"},{"title":"Repositories","date":"2021-01-04T11:28:06.143Z","updated":"2021-01-04T11:28:06.143Z","comments":false,"path":"repository/index.html","permalink":"http://acerzhou.github.io/Blog/repository/index.html","excerpt":"","text":""},{"title":"Categories","date":"2021-01-05T01:35:20.025Z","updated":"2021-01-05T01:35:20.025Z","comments":false,"path":"categories/index.html","permalink":"http://acerzhou.github.io/Blog/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2021-01-05T01:30:39.195Z","updated":"2021-01-05T01:30:39.195Z","comments":false,"path":"tags/index.html","permalink":"http://acerzhou.github.io/Blog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Linx Command","slug":"Linx-Command","date":"2021-01-06T02:28:07.000Z","updated":"2021-01-06T02:28:07.726Z","comments":true,"path":"2021/01/06/Linx-Command/","link":"","permalink":"http://acerzhou.github.io/Blog/2021/01/06/Linx-Command/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"VS Code Plugins","slug":"VS-Code-Plugins","date":"2021-01-05T05:13:59.000Z","updated":"2021-01-08T05:47:44.582Z","comments":true,"path":"2021/01/05/VS-Code-Plugins/","link":"","permalink":"http://acerzhou.github.io/Blog/2021/01/05/VS-Code-Plugins/","excerpt":"","text":"VS Code is one of the best and most popular editors in today’s world. From my understanding, it becomes outstanding from tools in IT due to following reasons: Lightweight Cross Platform (Windows, Mac, Linux) High quality and multiple plugins Clean and simple UI In this post, I put some plugins I have used in my day to day job, and improve my productivity. Coding and Scripting HelperTabNineI have been used TabNine for a while, and it is become part of my working flow now. It is quite powerful and give good insight and improve productivity. However, it is still a bit different from XCode and Visual Studio suggestion. I think it is good enough and worth to try. Code RunnerCode Runner is a plugin I recently found. I feel it is really helpful when I want to try some code snippet. Previously, I always use online code playground to test out my idea or assumption. With this plugin, I can simply use the VS Code to do all the work. It is supper easy, set the language you want to run. And simple select the code, right click -&gt; select “Run Code” Or Use Ctrl+Alt+N, the result will shows in output. PerformanceImport CostImport Cost is a plugin helping you understand the size of bundle you imported in your JS file. file-sizefile-size is a plugin showing current file size. It is helpful when you want to know the size of file or strings. GitGitLensGitLens is one of the best plugins for Git in VS Code. Git is the most popular and common tools devs using today. GitLens really helps you understand what happens within the code. I really like it can give you hint on line by line on the author and date change of the code. Documentation and CommentsCode Spell CheckerCode Spell Checker is a plugin help spelling in code and document. Markdown All in OneMarkdown All in One is a plugin for Markdown. Markdown is a good and simple language used to create documents. Markdown All in One is a plugin helping writing Markdown in VS Code. BookmarksBookmarks is a plugin that you can set bookmark in file, so that you can come back at any time. 😉 Better CommentsWant you code comments more colourful ? Better Comments is here. It having highlight, alert, todo and query to present on comments. Todo TreeTodo Tree is a plugin to manage TODO comments in code repo. It is a good habit to resolve all TODO before building the PR. :) NavigationCamel Case NavigationCamel Case is one of popular way to naming variables and functions within programming. I used CTRL+-&gt; a lot to quick navigating throw the code. However, I sometime feel difficult to go into the word to change, as VS Code treat the camel case word as whole word. Using Camel Case Navigation, I can go into the middle of the word and make the change using CTRL+-&gt;. Feeling Awesome. Text and Data ProcessingJSON Parse &amp; StringifyToday, we are heavily working with Non-SQL DB and RESTful API, JSON is one of the most common data structure we are dealing with everyday. JSON Parse &amp; Stringify is a plugin to stringify or parse JSON data. Using online free tools, it has the risk to expose sensitive information within data. This plugin avoid the situation that you need some manipulation on JSON and JSON string. vscode-base64Base64 encoding and decoding is another translating we used a lot as developers. For example, HTTP Base Authentication requires both username and password need to be encoded to base64. vscode-base64 is a plugin that can do the job. jwt-decoderJSON Web Tokens(JWT) is used to represent claims between two parities. jwt-decoder can decode the JWT, and give more info on the token real content. Other ToolingRemote DevelopmentRemote Development is something that you can visual the ambition of MS for VS Code. As we are moving towards Cloud today, software development is also moving to Cloud. I am using this feature to work on this post which is located in my WSL system, and it is perfectly feeling like working in the same system. Highly recommended. REST ClientREST Client, a replacement for POST Man. I don’t know if anyone having a bit trouble using POST Man some time, this is a plugin that can work with APIs. The pro of this is easier to manage multiple endpoints and easily share if the team is using it. I am still trying to find a way to integrate this one into my workflow. Setting SyncSetting Sync is a plugin that can be used to share and maintain the settings of VS Code, I haven’t used this one yet, but I am going to try and find out if it is good. ThemesVSCode Great IconVSCode Great Icon, icon shows in explorer. I like this one with the simplicity. AyuAyu is a theme I am currently using. I feel dark mode making me exhausted after a while working and reading. I am using Ayu light, and so far, I am enjoy it.","categories":[{"name":"Resource","slug":"Resource","permalink":"http://acerzhou.github.io/Blog/categories/Resource/"},{"name":"VSCode","slug":"Resource/VSCode","permalink":"http://acerzhou.github.io/Blog/categories/Resource/VSCode/"}],"tags":[{"name":"vscode","slug":"vscode","permalink":"http://acerzhou.github.io/Blog/tags/vscode/"},{"name":"plugin","slug":"plugin","permalink":"http://acerzhou.github.io/Blog/tags/plugin/"},{"name":"productivity","slug":"productivity","permalink":"http://acerzhou.github.io/Blog/tags/productivity/"}]},{"title":"Websites","slug":"websites","date":"2021-01-05T05:06:18.000Z","updated":"2021-01-05T23:26:55.626Z","comments":true,"path":"2021/01/05/websites/","link":"","permalink":"http://acerzhou.github.io/Blog/2021/01/05/websites/","excerpt":"","text":"BooksGate’s Note Code ChallengeAdvent of CodeLeetCode 中文博客(Chinese Blog)扯氮集阮一峰的博客 Gaming ArtGGAC","categories":[{"name":"Resource","slug":"Resource","permalink":"http://acerzhou.github.io/Blog/categories/Resource/"}],"tags":[{"name":"weblinks","slug":"weblinks","permalink":"http://acerzhou.github.io/Blog/tags/weblinks/"},{"name":"blogs","slug":"blogs","permalink":"http://acerzhou.github.io/Blog/tags/blogs/"}]},{"title":"2021 - First Post","slug":"2021","date":"2021-01-04T11:31:29.000Z","updated":"2021-01-04T11:58:52.413Z","comments":true,"path":"2021/01/04/2021/","link":"","permalink":"http://acerzhou.github.io/Blog/2021/01/04/2021/","excerpt":"","text":"G’Day Mate. This is Acer Zhou, welcome to my personal blog space Acer’s Note. I have been thinking to create a blog for a long long time, but never commit to it. This time, I’d like to give it a try and put some effort here, to create a space recording and sharing the journey I have been through. Currently, for this site, I am going to focus on but not limited to following content: Diary &amp; Casual thinking Tech &amp; Programming Some Useful Resources I hope I can take this on, and make it become a small conner on the Internet.And most important, hope you enjoy it. :) Let’s rock, 2021 !","categories":[{"name":"Diary","slug":"Diary","permalink":"http://acerzhou.github.io/Blog/categories/Diary/"}],"tags":[{"name":"2021","slug":"2021","permalink":"http://acerzhou.github.io/Blog/tags/2021/"},{"name":"diary","slug":"diary","permalink":"http://acerzhou.github.io/Blog/tags/diary/"},{"name":"firstPostInYear","slug":"firstPostInYear","permalink":"http://acerzhou.github.io/Blog/tags/firstPostInYear/"}]},{"title":"Hello World From Acer's Note","slug":"hello-world","date":"2021-01-04T11:28:06.133Z","updated":"2021-01-04T11:28:06.133Z","comments":true,"path":"2021/01/04/hello-world/","link":"","permalink":"http://acerzhou.github.io/Blog/2021/01/04/hello-world/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"Resource","slug":"Resource","permalink":"http://acerzhou.github.io/Blog/categories/Resource/"},{"name":"VSCode","slug":"Resource/VSCode","permalink":"http://acerzhou.github.io/Blog/categories/Resource/VSCode/"},{"name":"Diary","slug":"Diary","permalink":"http://acerzhou.github.io/Blog/categories/Diary/"}],"tags":[{"name":"vscode","slug":"vscode","permalink":"http://acerzhou.github.io/Blog/tags/vscode/"},{"name":"plugin","slug":"plugin","permalink":"http://acerzhou.github.io/Blog/tags/plugin/"},{"name":"productivity","slug":"productivity","permalink":"http://acerzhou.github.io/Blog/tags/productivity/"},{"name":"weblinks","slug":"weblinks","permalink":"http://acerzhou.github.io/Blog/tags/weblinks/"},{"name":"blogs","slug":"blogs","permalink":"http://acerzhou.github.io/Blog/tags/blogs/"},{"name":"2021","slug":"2021","permalink":"http://acerzhou.github.io/Blog/tags/2021/"},{"name":"diary","slug":"diary","permalink":"http://acerzhou.github.io/Blog/tags/diary/"},{"name":"firstPostInYear","slug":"firstPostInYear","permalink":"http://acerzhou.github.io/Blog/tags/firstPostInYear/"}]}